;; -*- no-byte-compile: t; -*-

(package! modus-themes)

(package! deferred)

(package! app-launcher
  :recipe
  (:host github :repo "SebastienWae/app-launcher"))
(package! monitors
  :recipe
  (:host gitlab :repo "e4303/packages/monitors"))
(package! polybar
  :recipe
  (:host gitlab :repo "e4303/packages/polybar.el"))


(package! exwm)
(package! desktop-environment)

(package! git-timemachine)
